/* 
  SBXErrors.strings
  Secrets

  Created by Paulo Andrade on 9/25/12.

*/

"UnexpectedError.errorDescription" = "Error inesperado";
"UnexpectedError.failureReason" = "Lo sentimos, pero la operación ha fallado debido a un error inesperado. Ponte en contacto con el servicio de asistencia si el problema continúa.";

"ModelInvalidProperty.errorDescription" = "Valor no válido";
"ModelInvalidProperty.failureReason" = "A %@ %@ must be a %@";

"DataStoreIncompatibleMasterKeyError.errorDescription" = "Clave maestra no compatible";
"DataStoreIncompatibleMasterKeyError.failureReason" = "La clave maestra de este documento no ha completado la validación.";

"DataStoreMustBeUnlockedError.errorDescription" = "Datos guardados bloqueados";
"DataStoreMustBeUnlockedError.failureReason" = "El almacén de datos debe estar desbloqueado para realizar esta operación.";

"DataStoreNotPassphraseProtectedError.errorDescription" = "Almacén de datos desprotegido";
"DataStoreNotPassphraseProtectedError.failureReason" = "El almacén de datos no está protegido con contraseña aún.";

"DataStoreCorruptedError.errorDescription" = "El documento no es válido";
"DataStoreCorruptedError.failureReason" = "No se ha podido abrir el documento, puede que esté dañado.";

"DataStoreURLNotSetError.errorDescription" = "URL de almacén no establecido";
"DataStoreURLNotSetError.failureReason" = "La URL del almacén debe establecerse antes de realizar esta operación.";

"DataStoreSynchronizationFailedError.errorDescription" = "Error de sincronización";
"DataStoreSynchronizationFailedError.failureReason" = "La sincronización ha fallado debido a un error inesperado.";

"DataStoreIncorrectPassphraseError.errorDescription" = "Contraseña incorrecta";
"DataStoreIncorrectPassphraseError.failureReason" = "No se han podido desbloquear los datos con la contraseña indicada.";

"DataStoreMigrationUnknownModelError.errorDescription" = "Se necesita actualización";
/*
 * The %@ will be replaced by the application name. Example:
 * It seems your data was saved using a more recent version of Secrets.
*/
"DataStoreMigrationUnknownModelError.failureReason" = "Parece que tus datos se guardaron con una versión más reciente de %@.";
/*
 * The %@ will be replaced by the application name. Example:
 * It seems your data was saved using a more recent version of Secrets. Please update to the latest version and try again.
*/
"DataStoreMigrationUnknownModelError.recoverySuggestion" = "Parece que tus datos se guardaron con una versión más reciente de %@. Actualiza a la versión más reciente y vuelve a intentarlo.";

"DataStoreMigrationSourceMetadataError.errorDescription" = "Formato de archivo desconocido";
"DataStoreMigrationSourceMetadataError.failureReason" = "No se ha podido identificar el formato de archivo";

"NetworkConnectionVersionMismatchError.errorDescription" = "Incompatibilidad de versiones";
"NetworkConnectionVersionMismatchError.failureReason" = "El dispositivo al que intentas conectarte funciona con una versión no compatible. Asegúrate de que el software está actualizado.";

"NetworkConnectionInterruptedError.errorDescription" = "Error de conexión";
"NetworkConnectionInterruptedError.failureReason" = "La conexión se ha interrumpido por un motivo desconocido.";

"NetworkConnectionBadRequestError.errorDescription" = "Error de conexión";
"NetworkConnectionBadRequestError.failureReason" = "La conexión se ha interrumpido por una solicitud errónea.";

"NetworkConnectionInternalError.errorDescription" = "Error de conexión";
"NetworkConnectionInternalError.failureReason" = "La conexión ha fallado debido a un error interno.";

"NetworkConnectionUnauthorizedRequestError.errorDescription" = "Error de conexión";
"NetworkConnectionUnauthorizedRequestError.failureReason" = "La conexión se ha interrumpido por una solicitud no autorizada.";

"NetworkConnectionFailedError.errorDescription" = "Error de conexión";
"NetworkConnectionFailedError.failureReason" = "No se ha podido establecer una conexión con un homólogo. Comprueba los ajustes de Wi-Fi y de Bluetooth.";

"NetworkConnectionTimedOutError.errorDescription" = "Tiempo de espera de conexión agotado";
"NetworkConnectionTimedOutError.failureReason" = "No se ha podido establecer una conexión en un tiempo razonable.";

"OperationCancelledError.errorDescription" = "Operación cancelada";
"OperationCancelledError.failureReason" = "Se ha cancelado la operación debido a tu solicitud.";

"OperationTimedOutError.errorDescription" = "Tiempo de espera de operación agotado";
"OperationTimedOutError.failureReason" = "No se ha podido finalizar la operación en un tiempo razonable.";

"UbiquitousSyncNotEnabledError.errorDescription" = "iCloud Sync deshabilitado";
"UbiquitousSyncNotEnabledError.failureReason" = "iCloud Sync debe estar habilitado para realizar esta operación.";

"UbiquitousSyncIdentifierDiffersError.errorDescription" = "Incompatibilidad de iCloud Sync";
"UbiquitousSyncIdentifierDiffersError.failureReason" = "Parece que los datos almacenados en iCloud son de un usuario diferente. Puede que hayas cambiado a un usuario de iCloud diferente desde la primera vez que habilitaste iCloud Sync.";

"UbiquitousStoreUnlockableError.errorDescription" = "No se pudo sincronizar con iCloud";
"UbiquitousStoreUnlockableError.failureReason" = "No se han podido desbloquear los datos de iCloud, puede que la contraseña haya cambiado.";
"UbiquitousStoreUnlockableError.recoverySuggestion" = "Si has cambiado tu contraseña en otro dispositivo, actualiza tu contraseña aquí con iCloud Sync.";

"UbiquitousStoreUnprotectedError.errorDescription" = "El almacén de iCloud no está protegido con contraseña.";
"UbiquitousStoreUnprotectedError.failureReason" = "Cancelando la sincronización con iCloud porque el almacén no está protegido con contraseña.";

"PairingFailedError.errorDescription" = "Error al vincular";
"PairingFailedError.failureReason" = "No se pudo completar la vinculación con el homólogo.";

"PairingDeniedError.errorDescription" = "Vinculación rechazada";
"PairingDeniedError.failureReason" = "El homólogo ha rechazado la solicitud de vinculación.";

"SyncingFailedError.errorDescription" = "Error al sincronizar";
"SyncingFailedError.failureReason" = "No se ha podido completar la sincronización.";

"PersistentStoreLockedError.errorDescription" = "Se está usando el almacén";
"PersistentStoreLockedError.failureReason" = "Vuelve a intentar la operación en un momento.";

"UnsuportedDocumenTypeError.errorDescription" = "Tipo de documento no compatible ";
"UnsuportedDocumenTypeError.failureReason" = "El documento solicitado no se admite.";

"WrongDocumentPassphraseError.errorDescription" = "Contraseña errónea";
"WrongDocumentPassphraseError.failureReason" = "No se ha podido abrir el documento con la contraseña proporcionada.";

/*
 * The %@ will be replaced by another application name. Example:
 * 
 * Failed to communicate with Safari.
*/
"ScriptingBridgeError.errorDescription" = "No se puede comunicar con %@";
"ScriptingBridgeError.failureReason" = "No se ha podido solicitar que %@ realice la operación deseada.";

"CouldNotSaveDocumentError.errorDescription" = "No se ha podido guardar el documento";
"CouldNotSaveDocumentError.failureReason" = "Se ha producido un error al intentar guardar tu documento.";

"SecureEnclaveNotAvailableError.errorDescription" = "Autenticación de dispositivo no disponible.";
"SecureEnclaveNotAvailableError.failureReason" = "Tu dispositivo debe tener una contraseña o Touch ID habilitada para usar esta característica.";

"IACError.UnsupportedCallback" = "%@' no es una acción x-callback-url admitida por %@";
"IACError.UnsupportedScheme" = "No hay una aplicación con el esquema '%@' instalada en este dispositivo.";

"SyncMissingPremium.errorDescription" = "Sincronización deshabilitada";
"SyncMissingPremium.failureReason" = "Mejora a la versión Premium para seguir sincronizando con más de
%d elementos.";

"ImportMissingPremium.errorDescription" = "Importar límite de impacto de elementos gratis";
"ImportMissingPremium.failureReason" = "La versión gratuita se limita a %d elementos. Mejora y vuelve a importar este archivo.";

